Repository: bdumas/geocrazy
Catalog: trunk/geoCrazy/locales/*/main.po
Languages: es

source: Location:
es: Ubicación:

source: Add location
es: Añadir ubicación

source: Edit location
es: Editar ubicación

source: Override default display
es: Enmendar la visualización por defecto

source: Title:
es: Título:

source: Width:
es: Anchura:

source: Height:
es: Altura:

source: Type:
es: Tipo::

source: physical
es: relieve

source: normal
es: mapa

source: satellite
es: satélite

source: hybrid
es: mezcla

source: Display address:
es: Exponer la dirección

source: do not display
es: no exponer

source: display
es: exponer

source: GeoCrazy Map
es: GeoCrazy mapa

source: Object of the map:
es: Tema de la mapa:

source: post location
es: ubicación del artículo

source: blog location (home only)
es: ubicación del blog (sólo la página frontal)

source: blog location (all pages)
es: ubicación del blog (todas las páginas)

source: Location
es: Ubicación

source: Width (in pixels, empty value = 100%):
es: Anchura (en píxels, no valor = 100%):

source: Height (in pixels):
es: Altura (en píxels)

source: Zoom (0 = far, 19 = close):
es: Zoom (0 = lejos, 19 = cerca)

source: Display address
es: Fijar la dirección

source: ID (If you use several GeoCrazy Map widgets, choose a different ID for each of them):
es: ID (si utiliza varios GeoCrazy mapas, elege un ID diferente para cada widget):

source: Blog position
es: Ubicación del blog

source: Blog country code
es: Código del país del blog

source: Blog country
es: País del blog

source: Blog region
es: Región del blog

source: Blog locality
es: Localidad del blog

source: Map your post
es: Sitúa el artículo en un mapa

source: was not found.
es: no ha estado encontrado.

source: Your location could not be found.
es: Su ubicación no ha podido estar encontrado.

source: Find location
es: Buscar ubicación

source: Go
es: Ir

source: Remove from map
es: Eliminar del mapa

source: Save location
es: Guardar ubicación

source: Cancel
es: Cancelar

source: Map provider
es: Proveedor de mapas

source: Yahoo Maps API key
es: Clave de API de Yahoo Maps

source: Multimap API key
es: Clave de API de Multimap

source: Enable multiple widget
es: Permitir varios widgets

source: Save address
es: Guardar la dirección

source: Override widget display
es: Enmendar la visualización por defecto del widget

source: Default location
es: Ubicación por defecto

source: Static map
es: Mapa estática

source: Settings have been successfully updated.
es: La configuración ha estado cambiado bien.

source: Configuration
es: Configuración

source: Settings
es: Configuración

source: Map provider:
es: Proveedor de mapas:

source: Yahoo Maps API key:
es: Clave de API de Yahoo Maps

source: Get your Yahoo Maps API key
es: Consigue su clave de API de Yahoo Maps

source: Multimap API key:
es: Clave de API de Multimap

source: Get your Multimap API key
es: Consigue su clave de API de Multimap

source: Try to save the address of the location (region and locality)
es: Tratar de registrar la dirección (región y localidad)

source: Enable override of widget display
es: Permitir de enmendar la visualización por defecto del widget

source: Default location when adding a location to a post:
es: Ubicación por defecto:

source: No default location
es: No ubicación por defecto

source: Blog location
es: Ubicación del blog

source: Try to locate the author
es: Tratar de localizar el autor

source: Save
es: Guardar

source: Blog localization
es: Ubicación del blog

source: GeoRSS feed
es: Fuente GeoRSS

source: If you have already localized some posts of your blog, the RSS (and atom) feeds are now GeoRSS feeds which can be displayed on a map.
es: Si ya ha localizado unos articulos del blog, el fuente RSS (y atom) son GeoRSS, cuales pueden ser visualizado en un mapa.

source: My RSS feed:
es: Mi fuente RSS:

source: My RSS feed displayed in Google Maps:
es: Mi fuente RSS visualizado en Google Maps:

source: My RSS feed displayed in Live Maps:
es: Mi fuente RSS visualizado en Live Maps:

source: To help web search engines to index your geolocalised contents, you can submit to them your geo sitemap.
es: Para ayudar motores de búsqueda a indexar sus articulos geoetiquetados, puede someter su geo sitemap.

source: My geo sitemap:
es: Mi geo sitemap:

source: Documentation
es: Documentación

source: About
es: Acerca de...

source: GeoCrazy is written by Benjamin Dumas
es: Geocrazy esta escrito por Benjamin Dumas

source: For some help, please write a comment on
es: Si necesita ayuda, escribe un comentario en

source: the support page of GeoCrazy
es: la página web de GeoCrazy

source: Google Maps API key
es: Clave de API de Google Maps

source: Google Maps API key:
es: Clave de API de Google Maps:

source: Get your Google Maps API key
es: Consigue su clave de API de Google Maps

source: Advanced parameters
es: Configuración adelantada

source: Default location when adding a location to a post
es: Ubicación por defecto al añadir un ubicación a un billete

source: post
es: billete

source: Place
es: Ubicación

source: Latitude
es: Latitud

source: Longitude
es: Longitud
