<style type="text/css">
h2 {margin-top: 1.5em}
h3 {margin-top: 1em}
ul.space li {margin-bottom: 3px}
</style>

<strong>GeoCrazy</strong> est un plugin pour Dotclear 2 qui permet de g&eacute;olocaliser les billets d'un blog, c'est-&agrave;-dire associer des coordonn&eacute;es g&eacute;ographiques &agrave; chaque billet du blog.<br/> 
Cette g&eacute;olocalisation permet :
<ul>
	<li>de transformer les flux RSS et atom de votre blog en flux GeoRSS ;</li>
	<li>d'afficher pour chaque billet une carte du lieu associ&eacute; ;</li>
	<li>d'ajouter à chaque billet des métadonnées (Geo et ICBM) sur le lieu associ&eacute;.</li>
</ul>


<h2>1. Configuration</h2>

<h3>1.1. Pr&eacute;requis</h3>
Le plugin "metadata" (tags) est n&eacute;cessaire au fonctionnement du plugin GeoCrazy. Ce plugin, notamment utilis&eacute; pour le syst&egrave;me de tags, est livr&eacute; par d&eacute;faut avec Dotclear 2, donc vous devez probablement d&eacute;j&agrave; l'avoir.

<h3>1.2. Cl&eacute; d'API Google Maps</h3>
GeoCrazy utilise l'API Google Maps pour g&eacute;n&eacute;rer des cartes. Pour cela, une cl&eacute; diff&eacute;rente est n&eacute;cessaire pour chaque site. Vous pouvez demander gratuitement une cl&eacute; &agrave; Google en vous rendant &agrave; l'adresse suivante : <a href="http://code.google.com/intl/fr/apis/maps/signup.html">http://code.google.com/intl/fr/apis/maps/signup.html</a>.
<br/>
Lorsque vous avez r&eacute;cup&eacute;r&eacute; votre cl&eacute; Google Maps, rendez-vous dans l'onglet "Configuration", collez la cl&eacute; dans le champ texte et cliquez sur "Enregistrer".

<h3>1.3. Param&egrave;tres avanc&eacute;s</h3>
Ces param&egrave;tres vous permettent d'aller plus loin dans l'utilisation de GeoCrazy. Ils sont d&eacute;sactiv&eacute;s par d&eacute;faut.
<ul class="space">
	<li>Widget multiple : permet d'utiliser plusieurs widgets GeoCrazy carte sur une m&ecirc;me page (voir le paragraphe 3.2) gr&acirc;ce au champ suppl&eacute;mentaire "ID" (n'oubliez pas de mettre &agrave; jour les bandeaux dans la rubrique "Widgets de pr&eacute;sentation").</li>
	<li>Enregistrer l'adresse du lieu : lorsque cette option est activ&eacute;e, GeoCrazy enregistre, en plus des coordonn&eacute;es g&eacute;ographiques, la commune, la r&eacute;gion et le pays du lieu (lorsque ces informations sont disponibles). L'option "afficher le lieu" est alors disponible dans les param&egrave;tres du widget pour afficher ces informations sous la carte.</li>
	<li>Permettre le param&eacute;trage du widget par billet : activez cette option pour d&eacute;finir des param&egrave;tres d'affichage de la carte propres &agrave; chaque billet (voir le paragraphe 2.4).</li>
	<li>Lieu par d&eacute;faut : permet de d&eacute;finir un lieu qui sera pr&eacute;s&eacute;lectionn&eacute; lors de l'ouverture de la popup d'ajout d'un lieu &agrave; un billet. Les valeurs possibles sont les suivantes :
		<ul>
			<li>Aucun : aucun lieu n'est pr&eacute;s&eacute;lectionn&eacute;</li>
			<li>Lieu du blog : le lieu du blog est pr&eacute;s&eacute;lectionn&eacute; par d&eacute;faut</li>
			<li>Essayer de localiser l'auteur : le lieu o&ugrave; vous vous trouvez est pr&eacute;s&eacute;lectionn&eacute; (cette fonctionnalit&eacute; ne peut &ecirc;tre utilis&eacute;e que si votre navigateur impl&eacute;mente <a href="http://www.w3.org/TR/geolocation-API/">l'API Geolocation</a>)</li>
		</ul>
	</li>
</ul>

<h3>1.4. Localisation du blog</h3>
Ce menu permet d'associer un lieu au blog, de la m&ecirc;me mani&egrave;re qu'on associe un lieu &agrave; un billet (voir le paragraphe 2).
Lorsqu'un lieu est associ&eacute; au blog, les m&eacute;tadonn&eacute;es Geo et ICBM sont ajout&eacute;es &agrave; la page d'accueil.<br/>
Vous pouvez en plus choisir d'afficher le lieu du blog dans une carte en ajoutant un widget avec le param&egrave;tre "sujet de la carte" positionn&eacute; &agrave; "lieu du blog".


<h2>2. G&eacute;olocalisation d'un billet</h2>

<h3>2.1. Associer un lieu &agrave; un billet</h3>
Cr&eacute;ez un nouveau billet ou modifiez un billet existant. Dans la colonne de droite de la page d'&eacute;dition, une zone "Lieu" pr&eacute;sente un lien "Ajouter un lieu".
Cliquez sur ce lien pour ouvrir la popup de s&eacute;lection d'un lieu. 
S&eacute;lectionnez un lieu en le recherchant via le formulaire ou en cliquant sur la carte pour positionner le marqueur &agrave; l'endroit d&eacute;sir&eacute;. 
Lorsque le marqueur est plac&eacute; au bon endroit, cliquez sur "Enregistrer le lieu" pour valider et revenir sur l'&eacute;cran d'&eacute;dition du billet. 
Une carte appara&icirc;t alors pour indiquer le lieu associ&eacute; au billet.
Enregistrez le billet pour valider la localisation du billet.

<h3>2.2. Modifier le lieu associ&eacute; &agrave; un billet</h3>
Pour modifier le lieu d'un billet, il suffit de cliquer sur le lien "Modifier le lieu" situ&eacute; sous la carte sur la page d'&eacute;dition du billet et de proc&eacute;der comme &agrave; l'&eacute;tape pr&eacute;c&eacute;dente.

<h3>2.3. Supprimer le lieu associ&eacute; &agrave; un billet</h3>
Pour supprimer le lieu associ&eacute; &agrave; un billet, et ne pas le remplacer par un autre, cliquez sur le lien "Modifier le lieu" dans la page d'&eacute;dition du billet puis cliquez sur le lien "Supprimer de la carte" dans la popup. 
Validez le changement sur la popup et enregistrez le billet.

<h3>2.4. Param&egrave;tres de la carte (param&egrave;trage avanc&eacute;)</h3>
Cette option n'est disponible que si vous avez activ&eacute; le param&egrave;tre avanc&eacute; "Permettre le param&eacute;trage du widget par billet". 
On y retrouve les champs du widget (paragraphe 3.1).<br/>
Pour que la carte du widget s'affiche selon le param&eacute;trage d&eacute;fini dans le widget, laissez les champs vides.<br/>
Si vous affectez une valeur &agrave; un ou plusieurs champs, alors la carte du billet s'affichera selon les param&egrave;tres d&eacute;finis au niveau du billet. Les param&egrave;tres non renseign&eacute;s au niveau du billet prendront les valeurs d&eacute;finies au niveau du widget.<br/>
Par exemple, si vous avez choisi dans le widget un niveau de zoom &agrave; 10, mais que pour un billet pr&eacute;cis vous souhaitez que la carte s'affiche avec un zoom d'un niveau 15, changez juste la valeur du zoom au niveau du billet et laissez les autres champs vides.


<h2>3. Le widget GeoCrazy</h2>
Le widget GeoCrazy permet d'afficher une carte du lieu associ&eacute; &agrave; un billet ou au blog.

<h3>3.1. Param&eacute;trage du widget</h3>
Dans la rubrique "Widgets de pr&eacute;sentation" de l'administration du blog, faites glisser le widget "Carte GeoCrazy" &agrave; l'emplacement d&eacute;sir&eacute;.
En cliquant sur le signe "+", vous pouvez modifier les param&egrave;tres suivants :
<ul>
  <li>Sujet de la carte : choix du lieu &agrave; afficher et des pages où l'afficher
    <ul>
      <li>lieu du billet : affiche le lieu associ&eacute; au billet sur la page du billet</li>
      <li>lieu du blog (page d'accueil seulement) : affiche le lieu associ&eacute; au blog sur la page d'accueil du blog</li>
      <li>lieu du blog (toutes les pages) : affiche le lieu associ&eacute; au blog sur la page d'accueil et les pages des billets</li>
    </ul>
  </li>
	<li>Titre : permet d'afficher un titre au-dessus de la carte (peut-&ecirc;tre vide) ;</li>
	<li>Largeur : largeur de la carte en pixels (si aucune valeur n'est pr&eacute;cis&eacute;e, la carte prendra la plus grande largeur possible) ;</li>
	<li>Hauteur : hauteur de la carte en pixels (si aucune valeur n'est pr&eacute;cis&eacute;e, la carte aura une hauteur de 200 pixels) ;</li>
	<li>Zoom : niveau de zoom sur la carte (0 pour afficher la Terre enti&egrave;re, 19 pour zoomer au maximum (attention, certaines zones ne sont pas affichables pour un zoom trop &eacute;lev&eacute;)) ;</li>
	<li>Type : type de la carte (relief, plan, satellite ou mixte) ;</li>
	<li>Afficher le lieu (disponible seulement si le param&egrave;tre "Enregistrer l'adresse du lieu" est activ&eacute;) : affiche le nom du lieu (commune, r&eacute;gion et pays si ces informations ont &eacute;t&eacute; enregistr&eacute;es avec le lieu) sous la carte, avec le <a href="http://microformats.org/wiki/adr-fr">microformat adr</a>.</li>
	<li>ID (disponible seulement si le param&egrave;tre "widget multiple" est activ&eacute;) : n&eacute;cessaire si vous placez plusieurs widgets GeoCrazy sur une page (voir le paragraphe suivant).</li>
</ul>

<h3>3.2. Utilisation de plusieurs widgets (param&egrave;trage avanc&eacute;)</h3>
Il est possible de placer plusieurs fois le widget GeoCrazy dans les bandeaux de navigation et d'extra du blog. 
Par exemple si vous souhaitez afficher une carte globale et une carte rapproch&eacute;e du lieu concern&eacute;. 
Dans ce cas, pour des raisons techniques, vous devez affecter une valeur au champ "ID" diff&eacute;rente pour chaque widget (le champ "ID" n'est pr&eacute;sent que si vous avez activ&eacute; le mode "widget multiple", voir le paragraphe 1.3).


<h2>4. Flux GeoRSS, sitemap et m&eacute;tadonn&eacute;es g&eacute;ographiques</h2>
<p>GeoCrazy transforme les flux de votre blog (Atom et RSS) en flux GeoRSS. <a href="http://fr.wikipedia.org/wiki/GeoRSS">GeoRSS</a> est une extension des formats de syndication qui permet d'associer des coordonn&eacute;es g&eacute;ographiques &agrave;ux entr&eacute;es du flux. Les billets non localis&eacute;s restent bien s&ucirc;r pr&eacute;sents dans les flux.</p>
<p>En plus d'&ecirc;tre consultables dans un agr&eacute;gateur classique, les billets de votre blog peuvent maintenant &ecirc;tre affich&eacute;s dans une carte. Copiez-collez donc l'URL de votre flux RSS dans le champ "recherche" de <a href="http://maps.google.fr/">Google Maps</a> pour essayer. Vos billets g&eacute;olocalis&eacute;s s'affichent sur la carte. Sympa non ? Et cette manipulation n'est pas limit&eacute;e qu'&agrave; Google Maps, vous pouvez par exemple faire la m&ecirc;me chose avec <a href="http://maps.live.fr">Live Maps</a>.</p>
<p>Un autre avantage du format GeoRSS est l'indexation des contenus en fonction de crit&egrave;res g&eacute;ographiques. Les contenus peuvent alors &ecirc;tre restitu&eacute;s lors d'une recherche locale. 
Pour aider les moteurs de recherche &agrave; indexer vos contenus g&eacute;olocalis&eacute;s, GeoCrazy g&eacute;n&egrave;re un <a href="http://www.google.com/support/webmasters/bin/answer.py?hl=fr&answer=94554">sitemap g&eacute;ographique</a> (&agrave; l'adresse indiqu&eacute;e dans l'onglet "Configuration") que vous n'avez plus qu'&agrave; <a href="http://www.google.com/support/webmasters/bin/answer.py?answer=34575">soumettre aux moteurs de recherche</a>.
</p>
<p>Enfin, chaque page billet pour lequel un lieu a &eacute;t&eacute; associ&eacute; contient des balises m&eacute;ta aux formats <a href="http://geotags.com/geo/geotags2.html">Geo</a> et <a href="http://wikitravel.org/en/Wikitravel:Geographical_data_and_metadata">ICBM</a> renseignant sur le lieu associ&eacute;. Si un lieu est associ&eacute; au blog, la page d'accueil poss&egrave;de aussi ces balises meta. Ces informations sont exploitables avec des outils tels que l'extension Minimap pour Firefox.</p>