Repository: bdumas/geocrazy
Catalog: geoCrazy/locales/*/main.po
Languages: fr

source: Location:
fr: Lieu :

source: Add location
fr: Ajouter un lieu

source: Edit location
fr: Changer le lieu

source: Override default display
fr: Paramètres de la carte

source: physical
fr: relief

source: normal
fr: plan

source: hybrid
fr: mixte

source: Display address:
fr: Afficher le lieu :

source: do not display
fr: Ne pas afficher

source: display
fr: Afficher

source: Show on a bigger map
fr: Afficher sur une carte plus grande

source: GeoCrazy Map
fr: Carte GeoCrazy

source: Object of the map:
fr: Sujet de la carte

source: post location
fr: lieu du billet

source: blog location (home only)
fr: lieu du blog (page d'accueil seulement)

source: blog location (all pages)
fr: lieu du blog (toutes les pages)

source: Location
fr: Carte

source: Width (in pixels, empty value = 100%):
fr: Largeur (en pixels, vide = 100%) :

source: Height (in pixels):
fr: Hauteur (en pixels) :

source: Zoom (0 = far, 19 = close):
fr: Zoom (0 = éloigné, 19 = proche) :

source: Display address
fr: Afficher le lieu

source: ID (If you use several GeoCrazy Map widgets, choose a different ID for each of them):
fr: ID (Si vous placez plusieurs widgets GeoCrazy, choisissez un ID différent pour chacun) :

source: Blog position
fr: Localisation du blog

source: Blog country code
fr: Code pays du blog

source: Blog country
fr: Pays du blog

source: Blog region
fr: Région du blog

source: Blog locality
fr: Commune du blog

source: Map your post
fr: Placez votre billet sur la carte

source: was not found.
fr: ne peut pas être localisé.

source: Your location could not be found.
fr: Votre position n'a pas été trouvée.

source: Find location
fr: Rechercher un lieu

source: Go
fr: OK

source: Remove from map
fr: Supprimer de la carte

source: Save location
fr: Enregistrer le lieu

source: Map provider
fr: Fournisseur de carte

source: Yahoo Maps API key
fr: Clé Yahoo Maps API

source: Multimap API key
fr: Clé Multimap API

source: Enable multiple widget
fr: Mode "widget multiple" pour placer plusieurs fois le même widget

source: Save address
fr: Enregistrer l'adresse

source: Override widget display
fr: Surcharge des paramètres du widget

source: Default location
fr: Lieu par défaut

source: Static map
fr: Carte statique

source: Link to a bigger map
fr: Lien vers une carte plus grande

source: Settings
fr: Paramètres

source: Map provider:
fr: Fournisseur de carte :

source: Yahoo Maps API key:
fr: Clé Yahoo Maps API :

source: Get your Yahoo Maps API key
fr: Demander votre clé Yahoo Maps API

source: Multimap API key:
fr: Clé Multimap API

source: Get your Multimap API key
fr: Demander votre clé Multimap API

source: Try to save the address of the location (region and locality)
fr: Enregistrer l'adresse du lieu

source: Enable override of widget display
fr: Permettre le paramétrage du widget par billet

source: Default location when adding a location to a post:
fr: Lieu par défaut lors de l'ajout d'un lieu :

source: No default location
fr: Aucun

source: Blog location
fr: Lieu du blog

source: Try to locate the author
fr: Essayer de localiser l'auteur

source: Blog localization
fr: Localisation du blog

source: GeoRSS feed
fr: Flux GeoRSS

source: If you have already localized some posts of your blog, the RSS (and atom) feeds are now GeoRSS feeds which can be displayed on a map.
fr: Si vous avez déjà géolocalisé des billets, les flux RSS (ou Atom) sont maintenant des flux GeoRSS qui peuvent être affichés sur une carte.

source: My RSS feed:
fr: Mon flux RSS :

source: My RSS feed displayed in Google Maps:
fr: Mon flux RSS affiché dans Google Maps :

source: My RSS feed displayed in Live Maps:
fr: Mon flux RSS affiché dans Live Maps :

source: Geo sitemap
fr: Sitemap géographique

source: To help web search engines to index your geolocalised contents, you can submit to them your geo sitemap.
fr: Pour aider les moteurs de recherche à indexer vos contenus géolocalisé, vous pouvez leur soumettre votre sitemap géographique.

source: My geo sitemap:
fr: Mon sitemap géographique :

source: About
fr: A propos

source: GeoCrazy is written by Benjamin Dumas
fr: GeoCrazy est écrit par Benjamin Dumas

source: For some help, please write a comment on
fr: Pour toute question, suggestion, remarque, témoignage... veuillez laisser un commentaire sur

source: the support page of GeoCrazy
fr: la page support de GeoCrazy

source: Google Maps API key
fr: Clé Google Maps API

source: Google Maps API key:
fr: Clé Google Maps API :

source: Get your Google Maps API key
fr: Demander votre clé Google Maps API

source: Advanced parameters
fr: Paramètres avancés

source: Default location when adding a location to a post
fr: Lieu par défaut lors de l'ajout d'un lieu

source: post
fr: billet

source: Place
fr: Lieu

source: Link to bigger map
fr: Lien vers une carte plus grande

source: Link to Google Maps
fr: Lien vers Google Maps

source: Show in Google Maps
fr: Afficher dans Google Maps

source: Blog country name
fr: Nom du pays du blog

source: bloghomeonly
fr: blog (page d'accueil seulement)

source: blog
fr: blog (toutes les pages)

source: Blog placename
fr: Lieu du blog

source: Display address under the map
fr: Afficher l'adresse sous la carte

source: Advanced mode
fr: Mode avancé

source: advanced
fr: avancé

source: In advanced mode, you can use several GeoCrazy widgets.
fr: Avec le mode avancé, vous pouvez placer plusieurs widgets GeoCrazy.

source: For some help, please write a comment on
fr: Pour toute question, suggestion, remarque, témoignage... veuillez laisser un commentaire sur
